python
1. variables -storing data
2. data types - int float string - string **list dictionary** sets range
3. function -create reusable code, lots of lines of code in one place
4. classes - help us containerise code, box things up

libraries
1. numpy - **arrays** we can create matrices, numerical calculation
2. pandas - **dataframes** store data like spread sheets, excel. We can manipulate those tables

Machine learning
1. data - clean data, analyse data, play with data
2. feed to the machine
3. show the machine what is right, what is wrong
4. ask question get answers

In [17]:
#Create a small dictionary
#names of a student and their marks

student = {
    'Aminuddin': 85,
    'Ahmad':90,
    'Aiman':89
    }

In [18]:
print(student)

{'Aminuddin': 85, 'Ahmad': 90, 'Aiman': 89}

In [2]:
students_csv ={
    'name':["Amin","Aiman","Aina",'Ahmad','Atirah'],
    'math':[90,80,70,60,50],
    'english':[80,70,60,50,40],
    'science':[70,60,50,40,30]
}
print(students_csv)

{'name': ['Amin', 'Aiman', 'Aina', 'Ahmad', 'Atirah'], 'math': [90, 80, 70, 60, 50], 'english': [80, 70, 60, 50, 40], 'science': [70, 60, 50, 40, 30]}

In [40]:
students_csv["name"]

['Amin', 'Aiman', 'Aina', 'Ahmad', 'Atirah']

In [42]:
students_csv['name'][4]

'Atirah'

In [ ]:
pip install pandas

In [3]:
import pandas as pd
df = pd.DataFrame(students_csv)  
df
print('\n first table -------\n',df,'\n')
print('\n second table -------\n',df,)
print('\n third table -------\n',df)

 first table -------
      name  math  english  science
0    Amin    90       80       70
1   Aiman    80       70       60
2    Aina    70       60       50
3   Ahmad    60       50       40
4  Atirah    50       40       30


 second table -------
      name  math  english  science
0    Amin    90       80       70
1   Aiman    80       70       60
2    Aina    70       60       50
3   Ahmad    60       50       40
4  Atirah    50       40       30

 third table -------
      name  math  english  science
0    Amin    90       80       70
1   Aiman    80       70       60
2    Aina    70       60       50
3   Ahmad    60       50       40
4  Atirah    50       40       30

In [44]:
type(df)     ### numpy.ndarray

pandas.core.frame.DataFrame

In [48]:
df.head(3)   ### top part of a df is the default arguments
df.tail(4)

     name  math  english  science
1   Aiman    80       70       60
2    Aina    70       60       50
3   Ahmad    60       50       40
4  Atirah    50       40       30

In [59]:
#We can access certain columns in dataframes also

print('marks of all students for subject math is \n', df.math)

marks of all students for subject math is
 0    90
1    80
2    70
3    60
4    50
Name: math, dtype: int64

In [61]:
print('marks for Aina in subject math is \n', df.math[2])
print('marks of all students for subject english is \n', df.english)

marks for Aina in subject math is
 70
marks of all students for subject english is
 0    80
1    70
2    60
3    50
4    40
Name: english, dtype: int64

In [72]:
# Series ... simply take list

marks_series = pd.Series([10,20,30,40,50],name='biology')
#type(marks_series)

print(marks_series)

0    10
1    20
2    30
3    40
4    50
Name: biology, dtype: int64

In [65]:
df

     name  math  english  science
0    Amin    90       80       70
1   Aiman    80       70       60
2    Aina    70       60       50
3   Ahmad    60       50       40
4  Atirah    50       40       30

In [68]:
print('Marks Amin for subject English is \t',df.english[0])

Marks Amin for subject English is 	 80

In [69]:
df.english[0]

np.int64(80)

In [73]:
print(f'In English {df.name[2]} had {df.english[2]} marks')

In English Aina had 60 marks

In [77]:
#another method (lebih sempoi)
at = df['name'][3]
at_english = df['english'][3]

print(f' In English {at} had {at_english} marks')

 In English Ahmad had 50 marks

In [78]:
#core data types we use in pandas?
#dataframe
#series

In [ ]:
#Create a series of data 5 values of temperature
#dataframe city and temperature - 5 cities

In [89]:
#temps = pd.Series(['2','10','20','23','36'],name='temperature')
#cities = pd.Series(['Alaska','Korea','China','UK','Malaysia'],name='cities')

In [150]:
df = pd.DataFrame(temps,cities)
df

            0
cities
Alaska    NaN
Korea     NaN
China     NaN
UK        NaN
Malaysia  NaN

In [152]:
temp2 = pd.Series([2,10,20,23,36])
print('Type of temp2 is:',type(temp2))

#a dictionary
temperature = {
    'cities' : ['Alaska','Italy','US','UK','Malaysia'],
    'temp1'  : [10,20,30,22,28]
}
temp_df = pd.DataFrame(temperature)
print(temp_df)
print(temp2)

Type of temp2 is: <class 'pandas.core.series.Series'>
     cities  temp1
0    Alaska     10
1     Italy     20
2        US     30
3        UK     22
4  Malaysia     28
0     2
1    10
2    20
3    23
4    36
dtype: int64

In [156]:
#Buat method mcm ni utk masukkan data yg kita dh buat kedalam column baru
temp_df['temp2'] = temp2
temp_df

     cities  temp1  temp2
0    Alaska     10      2
1     Italy     20     10
2        US     30     20
3        UK     22     23
4  Malaysia     28     36

Dataframes creates a column that does not exist

In [157]:
temp_df['temp3'] =pd.Series([3,23,33,21,39])
temp_df

     cities  temp1  temp2  temp3
0    Alaska     10      2      3
1     Italy     20     10     23
2        US     30     20     33
3        UK     22     23     21
4  Malaysia     28     36     39

In [158]:
#temp_df -----> add new temp as well
#you can create a new column
temp_df['new temp'] = {}
temp_df

     cities  temp1  temp2  temp3 new temp
0    Alaska     10      2      3      NaN
1     Italy     20     10     23      NaN
2        US     30     20     33      NaN
3        UK     22     23     21      NaN
4  Malaysia     28     36     39      NaN

In [159]:
temp_df['new temp'] =pd.Series([2,22,17,27,38])
temp_df

     cities  temp1  temp2  temp3  new temp
0    Alaska     10      2      3         2
1     Italy     20     10     23        22
2        US     30     20     33        17
3        UK     22     23     21        27
4  Malaysia     28     36     39        38

^^^^^^ Already Dataset  ^^^^^^^
* Save this a csv files ?

In [ ]:
#letak index=false untuk index x kluar ketika pandas read csv
temp_df.to_csv('Temperature City without row number.csv',index=False)

In [164]:
temp_df2 = pd.read_csv('Temperature City without row number.csv')
temp_df2

     cities  temp1  temp2  temp3  new temp
0    Alaska     10      2      3         2
1     Italy     20     10     23        22
2        US     30     20     33        17
3        UK     22     23     21        27
4  Malaysia     28     36     39        38

In [165]:
temp_df

     cities  temp1  temp2  temp3  new temp
0    Alaska     10      2      3         2
1     Italy     20     10     23        22
2        US     30     20     33        17
3        UK     22     23     21        27
4  Malaysia     28     36     39        38

In [ ]:
#untuk kira berapa byk muncul dalam table yg kita buat
#contohnya kita nak tahu berapa kali orang datang kat 7e dalam masa seminggu,sebulan
temp_df['cities'].value_counts()

cities
Alaska      1
Italy       1
US          1
UK          1
Malaysia    1
Name: count, dtype: int64

In [ ]:
#andaikan kita ad 10,000 dataset, tapi kita nk tahu berapa byk company yg berurusan dgn kita
#output x kluar benda yg sma
temp_df['cities'].unique()

array(['Alaska', 'Italy', 'US', 'UK', 'Malaysia'], dtype=object)

In [ ]:
# Nak check smaada data yg dlm table tu berulang atau x
temp_df['cities'].duplicated()

0    False
1    False
2    False
3    False
4    False
Name: cities, dtype: bool

In [171]:
#Dia akan remove data yg duplicate untuk kita tahu jumlah asal company yg kita berurusan
temp_df2 = temp_df['cities'].drop_duplicates()
temp_df2

0      Alaska
1       Italy
2          US
3          UK
4    Malaysia
Name: cities, dtype: object

In [8]:
df1 = pd.read_csv('Temperature City.csv')
df1

   Unnamed: 0    cities  temp1  temp2  temp3  new temp
0           0    Alaska     10      2      3         2
1           1     Italy     20     10     23        22
2           2        US     30     20     33        17
3           3        UK     22     23     21        27
4           4  Malaysia     28     36     39        38

In [11]:
dataf_2 = df1.drop('Unnamed: 0', axis=1) # #Dia buang column ^^^^
dataf_2

     cities  temp1  temp2  temp3  new temp
0    Alaska     10      2      3         2
1     Italy     20     10     23        22
2        US     30     20     33        17
3        UK     22     23     21        27
4  Malaysia     28     36     39        38

In [ ]:
dataf3 = dataf_2.drop(4, axis=0) # #Dia buang row >>>>>
dataf3

   cities  temp1  temp2  temp3  new temp
0  Alaska     10      2      3         2
1   Italy     20     10     23        22
2      US     30     20     33        17
3      UK     22     23     21        27

: